HirokiIshiguro/rx72n-envision-kit/Projects/aws_ether_rx72n_envision_kit/e2studio_ccrx/src/smc_gen/r_flash_spi/src/flash_types/r_flash_spi_type.c
    if (FLASH_SPI_SUCCESS > ret)
    {
        R_FLASH_SPI_Log_Func(FLASH_SPI_DEBUG_ERR_ID, (uint32_t)FLASH_SPI_TYPE, __LINE__);
        r_flash_spi_drvif_disable(devno);
        r_flash_spi_drvif_close(devno);
        return ret;
    }

    ret = r_flash_spi_drvif_disable(devno);
    if (FLASH_SPI_SUCCESS > ret)
    {
        R_FLASH_SPI_Log_Func(FLASH_SPI_DEBUG_ERR_ID, (uint32_t)FLASH_SPI_TYPE, __LINE__);
        r_flash_spi_drvif_disable(devno);     /* Unified error processing for ROM compression.    */
        r_flash_spi_drvif_close(devno);
        return ret;
    }

    /* Close driver interface. */
    ret = r_flash_spi_drvif_close(devno);
    if (FLASH_SPI_SUCCESS > ret)
    {
        R_FLASH_SPI_Log_Func(FLASH_SPI_DEBUG_ERR_ID, (uint32_t)FLASH_SPI_TYPE, __LINE__);
        r_flash_spi_drvif_disable(devno);     /* Unified error processing for ROM compression.    */
        r_flash_spi_drvif_close(devno);
        return ret;
    }

    return ret;
}


/************************************************************************************************
* Function Name: r_flash_spi_write_status
* Description  : Writes from the write status storage buffer to the status register 1.
* Arguments    : uint8_t         devno            ;   Device No. (FLASH_DEVn)
*              : uint8_t         * p_reg          ;   Status register 1 setting data buffer
* Return Value : FLASH_SPI_SUCCESS                ;   Successful operation
*              : FLASH_SPI_ERR_PARAM              ;   Parameter error
*              : FLASH_SPI_ERR_HARD               ;   Hardware error
*              : FLASH_SPI_ERR_OTHER              ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
flash_spi_status_t r_flash_spi_write_status(uint8_t devno, uint8_t * p_reg)
{
    flash_spi_status_t ret = FLASH_SPI_SUCCESS;
    uint32_t flash_type = 0;

    /* Check parameters. */
#if (BSP_CFG_PARAM_CHECKING_ENABLE)
    if ((FLASH_SPI_DEV_NUM <= devno) || (0 == p_reg))
    {
        R_FLASH_SPI_Log_Func(FLASH_SPI_DEBUG_ERR_ID, (uint32_t)FLASH_SPI_TYPE, __LINE__);
        return FLASH_SPI_ERR_PARAM;
    }
#endif /* BSP_CFG_PARAM_CHECKING_ENABLE */

    /* Open driver interface. */
    ret = r_flash_spi_drvif_open(devno);
    if (FLASH_SPI_SUCCESS > ret)
    {
        R_FLASH_SPI_Log_Func(FLASH_SPI_DEBUG_ERR_ID, (uint32_t)FLASH_SPI_TYPE, __LINE__);
        r_flash_spi_drvif_disable(devno);      /* Unified error processing for ROM compression.   */
        r_flash_spi_drvif_close(devno);
        return ret;
    }

    r_flash_spi_init_port(devno);                         /* Port initialization                  */

    /* Set SPI mode to mode 3 and bit rate for Command and Data as default. */
    ret = r_flash_spi_drvif_enable(devno);
    if (FLASH_SPI_SUCCESS > ret)
    {
        R_FLASH_SPI_Log_Func(FLASH_SPI_DEBUG_ERR_ID, (uint32_t)FLASH_SPI_TYPE, __LINE__);
        r_flash_spi_drvif_disable(devno);
        r_flash_spi_drvif_close(devno);
        return ret;
    }

    /* Executes the Write Register (WRR) command operation using the single mode. */
    if (FLASH_SPI_DEV0 == devno)
    {
#if (FLASH_SPI_CFG_DEV0_INCLUDED == 1)
        flash_type = gc_flash_dev0_types;
#endif /* (FLASH_SPI_CFG_DEV0_INCLUDED == 1) */
    }
    else
    {
#if (FLASH_SPI_CFG_DEV1_INCLUDED == 1)
        flash_type = gc_flash_dev1_types;
#endif /* (FLASH_SPI_CFG_DEV1_INCLUDED == 1) */
    }

    switch (flash_type)
    {
        case FLASH_SPI_TYPE_MX25L:
        case FLASH_SPI_TYPE_MX66L:
        case FLASH_SPI_TYPE_MX25R:
        case FLASH_SPI_TYPE_MX25U:
#if ((FLASH_SPI_CFG_DEV0_MX25L == 1) || (FLASH_SPI_CFG_DEV0_MX66L == 1) ||(FLASH_SPI_CFG_DEV0_MX25R == 1) || (FLASH_SPI_CFG_DEV0_MX25U == 1) || \
    (FLASH_SPI_CFG_DEV1_MX25L == 1) || (FLASH_SPI_CFG_DEV1_MX66L == 1) ||(FLASH_SPI_CFG_DEV1_MX25R == 1) || (FLASH_SPI_CFG_DEV1_MX25U == 1))
            ret = FLASH_SPI_ERR_OTHER;
#endif
        break;
        case FLASH_SPI_TYPE_AT25QF:
#if (FLASH_SPI_CFG_DEV0_AT25QF == 1 || FLASH_SPI_CFG_DEV1_AT25QF == 1)
            ret = r_flash_spi_at_write_stsreg1(devno, p_reg, FALSE);
#endif
        break;
        default:
            /* Do nothing. */
        break;
    }

    if (FLASH_SPI_SUCCESS > ret)
    {
        R_FLASH_SPI_Log_Func(FLASH_SPI_DEBUG_ERR_ID, (uint32_t)FLASH_SPI_TYPE, __LINE__);
        r_flash_spi_drvif_disable(devno);
        r_flash_spi_drvif_close(devno);
        return ret;
    }

    ret = r_flash_spi_drvif_disable(devno);
    if (FLASH_SPI_SUCCESS > ret)
    {
        R_FLASH_SPI_Log_Func(FLASH_SPI_DEBUG_ERR_ID, (uint32_t)FLASH_SPI_TYPE, __LINE__);
        r_flash_spi_drvif_disable(devno);     /* Unified error processing for ROM compression.    */
        r_flash_spi_drvif_close(devno);
        return ret;
    }

    /* Close driver interface. */
    ret = r_flash_spi_drvif_close(devno);
    if (FLASH_SPI_SUCCESS > ret)
    {
        R_FLASH_SPI_Log_Func(FLASH_SPI_DEBUG_ERR_ID, (uint32_t)FLASH_SPI_TYPE, __LINE__);
        r_flash_spi_drvif_disable(devno);     /* Unified error processing for ROM compression.    */
        r_flash_spi_drvif_close(devno);
        return ret;
    }

    return ret;
}


/************************************************************************************************
* Function Name: r_flash_spi_write_status2
* Description  : Writes from the write status storage buffer to the status register 2.
* Arguments    : uint8_t         devno            ;   Device No. (FLASH_DEVn)
*              : uint8_t         * p_reg          ;   Status register 2 setting data buffer
* Return Value : FLASH_SPI_SUCCESS                ;   Successful operation
*              : FLASH_SPI_ERR_PARAM              ;   Parameter error
*              : FLASH_SPI_ERR_HARD               ;   Hardware error
*              : FLASH_SPI_ERR_OTHER              ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
flash_spi_status_t r_flash_spi_write_status2(uint8_t devno, uint8_t * p_reg)
{
    flash_spi_status_t ret = FLASH_SPI_SUCCESS;
    uint32_t flash_type = 0;

